{
    "ItemList" : [
        {
            "src" : "IPad Pro M4.png",
            "model" : "iPad Pro (2024) | M4 Chip | 1 TB",
            "specifications" : "The iPad Pro with the M4 chip combines cutting-edge performance with a sleek and portable design, featuring either a stunning 12.9-inch or 11-inch Liquid Retina XDR display with a resolution of up to 2732 x 2048 pixels, providing incredibly vibrant colors, deep blacks, and sharp details. Powered by Apple’s M4 chip, which includes an 8-core CPU and up to a 10-core GPU, it delivers unparalleled performance for everyday tasks and intensive creative applications like video editing, 3D modeling, and gaming. The device supports up to 16 GB of unified memory and up to 2 TB of storage, ensuring smooth multitasking and ample space for large files. It includes a 12 MP ultra-wide front camera with Center Stage, along with a 12 MP wide and 10 MP ultra-wide rear camera system, making it ideal for professional photography, video calls, and content creation. Additionally, the iPad Pro supports Apple Pencil (2nd generation), Magic Keyboard, and Smart Keyboard Folio, enhancing productivity and creativity. Connectivity options feature Thunderbolt/USB 4, Wi-Fi 6E, and 5G support for fast and reliable networking. Running iPadOS, the iPad Pro with the M4 chip offers a powerful, portable solution for professionals, creatives, and everyday users seeking top-tier performance in a tablet.",
            "price" : "$1,299"
        },
        {
            "src" : "IPad Air M2.png",
            "model" : "iPad Air (2024) | M2 Chip | 256 GB",
            "specifications" : "The iPad Air with the M2 chip combines a powerful performance with a sleek and lightweight design, measuring just 6.1 mm thick and weighing around 1.02 pounds. It features a vibrant 10.9-inch Liquid Retina display with a resolution of 2360 x 1640 pixels, delivering stunning colors and sharp visuals. Powered by Apple’s M2 chip, which includes an 8-core CPU and an 8-core GPU, it provides exceptional performance for everyday tasks and demanding creative applications such as graphic design and video editing. The iPad Air supports up to 16 GB of unified memory and offers storage options ranging from 64 GB to 256 GB, ensuring smooth multitasking and ample space for files. It is equipped with a 12 MP ultra-wide front camera with Center Stage, and a 12 MP rear camera, making it ideal for video calls, photography, and content creation. The device supports the Apple Pencil (2nd generation) and the Magic Keyboard, enhancing productivity and creativity. Connectivity options include USB-C with support for Thunderbolt/USB 4, as well as Wi-Fi 6 and 5G support for fast and reliable networking. Running iPadOS, the iPad Air with the M2 chip provides a versatile and powerful solution for users seeking a high-performance tablet for both personal and professional use.",
            "price" : "$999"
        },
        {
            "src" : "IPad Pro M2.png",
            "model" : "iPad Pro (2022) | M2 Chip | 1 TB",
            "specifications" : "The iPad Pro with the M2 chip delivers unparalleled performance and versatility in a sleek design, available in both 12.9-inch and 11-inch models. It features a stunning Liquid Retina display on the 11-inch version and a Liquid Retina XDR display on the 12.9-inch version, with resolutions up to 2732 x 2048 pixels, offering vibrant colors, deep contrasts, and exceptional detail. Powered by Apple's M2 chip, which includes an 8-core CPU and up to a 10-core GPU, it handles demanding tasks such as video editing, 3D modeling, and gaming with ease. The iPad Pro supports up to 16 GB of unified memory and offers storage options up to 2 TB, ensuring smooth multitasking and ample space for large files. The device includes a 12 MP ultra-wide front camera with Center Stage and a dual rear camera system featuring a 12 MP wide and a 10 MP ultra-wide lens, making it perfect for high-quality photography and video calls. It also supports the Apple Pencil (2nd generation) and the Magic Keyboard, enhancing creativity and productivity. Connectivity options include Thunderbolt/USB 4, Wi-Fi 6E, and 5G support for fast and reliable networking. Running on iPadOS, the iPad Pro with the M2 chip is designed to meet the needs of professionals and creatives, providing a powerful and portable solution for a variety of tasks.",
            "price" : "$1,099"
        },
        {
            "src" : "IPad Air M1.png",
            "model" : "iPad Air (2022) | M1 Chip | 256 GB",
            "specifications" : "TThe iPad Air with the M1 chip offers a powerful performance in a lightweight and sleek design, measuring just 6.1 mm thick and weighing approximately 1.02 pounds. It features a stunning 10.9-inch Liquid Retina display with a resolution of 2360 x 1640 pixels, providing vibrant colors and sharp visuals for an immersive experience. Powered by Apple’s M1 chip, which includes an 8-core CPU and an 8-core GPU, the iPad Air delivers exceptional performance for everyday tasks and demanding applications such as graphic design and video editing. It supports up to 16 GB of unified memory and offers storage options ranging from 64 GB to 256 GB, ensuring smooth multitasking and ample space for files. The device is equipped with a 12 MP ultra-wide front camera with Center Stage, along with a 12 MP rear camera, making it ideal for video calls, photography, and content creation. Additionally, the iPad Air supports the Apple Pencil (2nd generation) and the Magic Keyboard, enhancing productivity and creativity. Connectivity options include USB-C with support for Thunderbolt/USB 4, as well as Wi-Fi 6 and 5G support for fast and reliable networking. Running on iPadOS, the iPad Air with the M1 chip provides a versatile and powerful solution for users seeking a high-performance tablet for both personal and professional use.",
            "price" : "$699"
        },
        {
            "src" : "IPad 10th Gen.png",
            "model" : "iPad 10th Generation (2022) | A14 Bionic Chip | 256 GB",
            "specifications" : "The iPad 10th generation features a sleek and modern design, measuring 7.0 mm thick and weighing approximately 1.0 pound, making it highly portable and user-friendly. It boasts a 10.9-inch Liquid Retina display with a resolution of 2360 x 1640 pixels, delivering vibrant colors and sharp visuals for an enhanced viewing experience. Powered by the A14 Bionic chip, the iPad 10th gen offers impressive performance for everyday tasks, gaming, and multimedia consumption. It supports up to 256 GB of storage, ensuring ample space for apps, photos, and videos, and includes a 12 MP ultra-wide front camera with Center Stage for engaging video calls, alongside a 12 MP rear camera for high-quality photography. The device is compatible with the first-generation Apple Pencil and the Magic Keyboard, boosting productivity and creativity. Connectivity features include USB-C for charging and data transfer, as well as Wi-Fi 6 for fast wireless networking. Running on iPadOS, the iPad 10th generation provides a versatile and capable tablet experience, suitable for both casual users and professionals alike.",
            "price" : "$499"
        },
        {
            "src" : "IPad Mini 6th Gen.png",
            "model" : "iPad Mini 6th Generation (2021) | A15 Bionic Chip | 256 GB",
            "specifications" : "The iPad Mini 6th generation offers a compact and powerful design, measuring just 6.3 mm thick and weighing approximately 0.66 pounds, making it highly portable and perfect for on-the-go use. It features an 8.3-inch Liquid Retina display with a resolution of 2266 x 1488 pixels, providing vibrant colors and sharp details for an immersive viewing experience. Powered by the A15 Bionic chip, the iPad Mini delivers impressive performance for everyday tasks, gaming, and creative applications. It supports up to 256 GB of storage, ensuring ample space for apps, photos, and videos, and is equipped with a 12 MP ultra-wide front camera with Center Stage for engaging video calls, along with a 12 MP rear camera for high-quality photography. The device supports the 2nd-generation Apple Pencil, allowing for precise drawing and note-taking, and features USB-C connectivity for charging and data transfer. With Wi-Fi 6 and optional 5G support, the iPad Mini 6th gen offers fast and reliable wireless connectivity. Running on iPadOS, it provides a versatile and efficient tablet experience, making it an excellent choice for both casual users and professionals seeking a powerful yet compact device.",
            "price" : "$499"
        }
    ]
}