{
    "ItemList" : [
        {
            "src" : "Iphone 15.png",
            "model" : "iPhone 15 | A16 Bionic Chip | 256 GB",
            "specifications" : "The iPhone 15 features a sleek design with dimensions of 147.6 x 71.6 x 7.8 mm and a weight of 171 grams, made from an aluminum frame with a Ceramic Shield front and glass back, available in colors like Pink, Yellow, Green, Blue, and Black. It has a 6.1-inch Super Retina XDR display with a resolution of 2556 x 1179 pixels and peak brightness up to 2000 nits. Powered by the A16 Bionic chip with 6 GB of RAM, it delivers impressive performance. The dual rear cameras include a 48 MP wide lens and a 12 MP ultra-wide lens, while the front 12 MP TrueDepth camera supports 4K video recording. With a battery life of up to 20 hours of talk time, it offers 20W wired and MagSafe wireless charging. Storage options range from 128 GB to 1 TB. Running iOS 17, it supports 5G, Wi-Fi 6E, Bluetooth 5.3, and features a USB-C port, along with Face ID and IP68 water and dust resistance.",
            "price" : "$799"
        },
        {
            "src" : "Iphone 15 Plus.png",
            "model" : "iPhone 15 Plus | A16 Bionic Chip | 256 GB",
            "specifications" : "The iPhone 15 Plus features a stylish design with dimensions of 158.4 x 77.8 x 7.8 mm and a weight of 203 grams, crafted from an aluminum frame with a Ceramic Shield front and glass back, available in colors such as Pink, Yellow, Green, Blue, and Black. It boasts a larger 6.7-inch Super Retina XDR display with a resolution of 2796 x 1290 pixels and peak brightness of up to 2000 nits. Powered by the A16 Bionic chip with 6 GB of RAM, the device ensures powerful performance. The dual rear camera system consists of a 48 MP wide lens and a 12 MP ultra-wide lens, complemented by a 12 MP TrueDepth front camera that supports 4K video recording. With an impressive battery life of up to 26 hours of talk time, it offers 20W wired and MagSafe wireless charging options. Storage capacities range from 128 GB to 1 TB. Running on iOS 17, the iPhone 15 Plus supports 5G connectivity, Wi-Fi 6E, Bluetooth 5.3, and features a USB-C port, along with Face ID and IP68 water and dust resistance.",
            "price" : "$899"
        },
        {
            "src" : "Iphone 15 Pro.png",
            "model" : "iPhone 15 Pro | A17 Bionic Chip | 512 GB",
            "specifications" : "The iPhone 15 Pro showcases a premium design with dimensions of 146.6 x 70.6 x 8.25 mm and a weight of 187 grams, featuring a titanium frame, Ceramic Shield front, and textured matte glass back, available in colors like Natural Titanium, Blue Titanium, White Titanium, and Black Titanium. It sports a 6.1-inch Super Retina XDR display with a resolution of 2556 x 1179 pixels and peak brightness up to 2000 nits. Equipped with the powerful A17 Pro chip and 8 GB of RAM, the device delivers exceptional performance. The triple-camera system includes a 48 MP wide lens, a 12 MP ultra-wide lens, and a 12 MP telephoto lens, while the 12 MP TrueDepth front camera supports 4K video recording. With a robust battery life of up to 23 hours of talk time, it features 20W wired and MagSafe wireless charging. Storage options range from 128 GB to 1 TB. Running on iOS 17, the iPhone 15 Pro supports advanced features like 5G connectivity, Wi-Fi 6E, Bluetooth 5.3, and includes a USB-C port, along with Face ID and IP68 water and dust resistance.",
            "price" : "$999"
        },
        {
            "src" :"Iphone 15 Pro Max.png",
            "model" :"iPhone 15 Pro Max | A17 Bionic Chip | 1 TB",
            "specifications" : "The iPhone 15 Pro Max features a sleek design with dimensions of 159.9 x 76.7 x 8.25 mm and a weight of 221 grams, constructed with a durable titanium frame, Ceramic Shield front, and textured matte glass back, available in colors such as Natural Titanium, Blue Titanium, White Titanium, and Black Titanium. It boasts a large 6.7-inch Super Retina XDR display with a resolution of 2796 x 1290 pixels and peak brightness of up to 2000 nits. Powered by the A17 Pro chip and equipped with 8 GB of RAM, the device ensures outstanding performance. The advanced triple-camera system includes a 48 MP wide lens, a 12 MP ultra-wide lens, and a 12 MP telephoto lens with 5x optical zoom, complemented by a 12 MP TrueDepth front camera that supports 4K video recording. With an impressive battery life of up to 29 hours of talk time, it offers 20W wired and MagSafe wireless charging options. Storage capacities range from 256 GB to 1 TB. Running on iOS 17, the iPhone 15 Pro Max supports 5G connectivity, Wi-Fi 6E, Bluetooth 5.3, and features a USB-C port, along with Face ID and IP68 water and dust resistance.",
            "price" : "$1,199"
        },
        {
            "src" : "Iphone 14.png",
            "model" :"iPhone 14 | A15 Bionic Chip | 256 GB",
            "specifications" : "The iPhone 14 features a sleek design with dimensions of 146.7 x 71.5 x 7.8 mm and a weight of 172 grams. It has an aluminum frame, Ceramic Shield front, and glass back, available in colors such as Midnight, Starlight, Blue, Purple, and Product(RED). The device features a 6.1-inch Super Retina XDR display with a resolution of 2556 x 1179 pixels and peak brightness of up to 2000 nits. Powered by the A15 Bionic chip and equipped with 6 GB of RAM, the iPhone 14 delivers solid performance. The dual-camera system includes a 12 MP wide lens and a 12 MP ultra-wide lens, with a 12 MP TrueDepth front camera supporting 4K video recording. It offers battery life of up to 20 hours of talk time, with 20W wired and MagSafe wireless charging capabilities. Storage options range from 128 GB to 512 GB. Running on iOS 16, the iPhone 14 supports 5G connectivity, Wi-Fi 6, Bluetooth 5.3, and features a Lightning port, along with Face ID and IP68 water and dust resistance.",
            "price" : "$799"
        },
        {
            "src" : "Iphone 14 Pro.png",
            "model" :"iPhone 14 Pro | A16 Bionic Chip | 512 GB",
            "specifications" : "The iPhone 14 Pro features a premium design with dimensions of 147.5 x 71.5 x 7.85 mm and a weight of 206 grams. It is crafted with a stainless steel frame, Ceramic Shield front, and textured matte glass back, available in colors like Space Black, Silver, Gold, and Deep Purple. The device boasts a 6.1-inch Super Retina XDR display with a resolution of 2556 x 1179 pixels and peak brightness of up to 2000 nits. Powered by the A16 Bionic chip and equipped with 6 GB of RAM, the iPhone 14 Pro delivers exceptional performance. The advanced triple-camera system includes a 48 MP wide lens, a 12 MP ultra-wide lens, and a 12 MP telephoto lens, complemented by a 12 MP TrueDepth front camera that supports 4K video recording. With a battery life of up to 23 hours of talk time, it offers 20W wired and MagSafe wireless charging options. Storage capacities range from 128 GB to 1 TB. Running on iOS 16, the iPhone 14 Pro supports 5G connectivity, Wi-Fi 6, Bluetooth 5.3, and features a Lightning port, along with Face ID and IP68 water and dust resistance",
            "price" : "$899"
        }
    ]
}